# Data Processing Before Mapping and Graph 
> **Steps of preprocessing of data**
*  Import necessary library
*  Read Dataset
*  Sanity check of data
*  Exploratory Data Analysis(EDA)
*  Missing Value treatments
*  Outliers treatments
*  duplicates & garbage value treatments
*  Normalization
*  Encoding of data

In [4]:
import pandas as pd
import numpy as np

In [5]:
dataset= pd.read_excel(r"C:\Users\kulso\Documents\Dashboards-Projects\pythonProjects\Customer Call List.xlsx")
dataset.head(1)

,CustomerID,First_Name,Last_Name,Phone_Number,Address,Paying Customer,Do_Not_Contact,Not_Useful_Column
0,1001,Frodo,Baggins,123-545-5421,"123 Shire Lane, Shire",Yes,No,True

Note: As we can in the above table there are lots of missing value, duplicate values, also use of special characters in Phone_Numbers and Last_Names column in multiple rows

In [6]:
#drop duplicate Values
dataset.drop_duplicates(inplace=True)
dataset.head(1)

,CustomerID,First_Name,Last_Name,Phone_Number,Address,Paying Customer,Do_Not_Contact,Not_Useful_Column
0,1001,Frodo,Baggins,123-545-5421,"123 Shire Lane, Shire",Yes,No,True

In [7]:
#drop unwanted column like "not_useful_column"
dataset.drop(columns='Not_Useful_Column',inplace=True)
dataset.head(1)

,CustomerID,First_Name,Last_Name,Phone_Number,Address,Paying Customer,Do_Not_Contact
0,1001,Frodo,Baggins,123-545-5421,"123 Shire Lane, Shire",Yes,No

In [8]:
#clean up Last_Name Column
dataset['Last_Name']=dataset['Last_Name'].str.strip('123._/')
dataset['Last_Name'] = dataset['Last_Name'].replace(np.nan, '')
dataset.head(1)

,CustomerID,First_Name,Last_Name,Phone_Number,Address,Paying Customer,Do_Not_Contact
0,1001,Frodo,Baggins,123-545-5421,"123 Shire Lane, Shire",Yes,No

In [13]:
#change float[Phone_Number] into String[Phone_Number] then clean up
dataset['Phone_Number'].apply(lambda x:str(x))

0     123-545-5421
1     123-643-9775
2     706-695-0392
3     123-543-2345
4     876-678-3469
5     304-762-2467
6
7     876-678-3469
8
9     123-545-5421
10
11    706-695-0392
12    123-543-2345
13    876-678-3469
14    304-762-2467
15    123-545-5421
16    123-643-9775
17    706-695-0392
18
19    876-678-3469
20    876-678-3469
Name: Phone_Number, dtype: object

In [12]:
#clean up Phone_Number column

dataset['Phone_Number'].astype('string')
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21 entries, 0 to 20
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   CustomerID         21 non-null     int64
 1   First_Name         21 non-null     object
 2   Last_Name          20 non-null     object
 3   Phone_Number       21 non-null     object
 4   Address            21 non-null     object
 5   Paying Customer    21 non-null     object
 6   Do_Not_Contact     17 non-null     object
 7   Not_Useful_Column  21 non-null     bool
 8   Street             21 non-null     object
 9   City               21 non-null     object
 10  State              21 non-null     object
dtypes: bool(1), int64(1), object(9)
memory usage: 1.8+ KB

In [9]:
def format_phone_number(phone):
    if pd.isna(phone) or phone in ['nan', 'N/a',]:
        return np.nan
    # Removing non-numeric characters
    phone = ''.join(filter(str.isdigit, phone))
    if len(phone) == 10:
        return f"{phone[0:3]}-{phone[3:6]}-{phone[6:10]}"
    return np.nan

# Applying the function to format the phone numbers
dataset['Phone_Number'] = dataset['Phone_Number'].astype(str).apply(format_phone_number)
dataset['Phone_Number'] = dataset['Phone_Number'].replace(np.nan, '')
dataset.head(1)

,CustomerID,First_Name,Last_Name,Phone_Number,Address,Paying Customer,Do_Not_Contact
0,1001,Frodo,Baggins,123-545-5421,"123 Shire Lane, Shire",Yes,No

In [39]:
dataset['Address']

0                     123 Shire Lane, Shire
1                       93 West Main Street
2                        298 Drugs Driveway
3     980 Paper Avenue, Pennsylvania, 18503
4                          123 Dragons Road
5                          768 City Parkway
6                         1209 South Street
7                             98 Clue Drive
8                          123 Middle Earth
9                25th Main Street, New York
10                    612 Shire Lane, Shire
11                     2394 Hogwarts Avenue
12                         2039 Main Street
13                         343 City Parkway
14                            214 HR Avenue
15                     2395 Hogwarts Avenue
16           121 Paper Avenue, Pennsylvania
17                          3498 Super Lane
18                                      N/a
19              910 Tatooine Road, Tatooine
Name: Address, dtype: object

In [10]:
#sort Address
dataset[['Street', 'City', 'State']] = dataset['Address'].str.split(',', expand=True, n=2)
dataset.head(1)

,CustomerID,First_Name,Last_Name,Phone_Number,Address,Paying Customer,Do_Not_Contact,Street,City,State
0,1001,Frodo,Baggins,123-545-5421,"123 Shire Lane, Shire",Yes,No,123 Shire Lane,Shire,None

In [11]:
dataset[['Street', 'City', 'State']] = dataset[['Street', 'City', 'State']].replace(np.nan, '')
dataset.replace('N/a','')
dataset.head(1)

,CustomerID,First_Name,Last_Name,Phone_Number,Address,Paying Customer,Do_Not_Contact,Street,City,State
0,1001,Frodo,Baggins,123-545-5421,"123 Shire Lane, Shire",Yes,No,123 Shire Lane,Shire,

In [12]:
#values replace and set in standard form
dataset["Paying Customer"] = dataset["Paying Customer"].replace({
    'Y': 'Yes',
    'N': 'No',
    'N/a': '' ,
}).fillna(' ')
dataset["Do_Not_Contact"] = dataset["Do_Not_Contact"].replace({
    'Y': 'Yes',
    'N': 'No',
    'N/a': '' ,
}).fillna(' ')
dataset.head(1)

,CustomerID,First_Name,Last_Name,Phone_Number,Address,Paying Customer,Do_Not_Contact,Street,City,State
0,1001,Frodo,Baggins,123-545-5421,"123 Shire Lane, Shire",Yes,No,123 Shire Lane,Shire,